tests/load/auth_p3001.yml
config:
  target: "http://127.0.0.1:3001"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Scaled Instance 2"
  payload:
    path: "users.csv"
    fields:
      - "email"
      - "password"
    order: "sequence"
scenarios:
  - name: "Login Flow (Port 3001)"
    flow:
      - get:
          url: "/api/auth/csrf"
          capture:
            json: "$.csrfToken"
            as: "csrf"
      - post:
          url: "/api/auth/callback/credentials"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            csrfToken: "{{ csrf }}"
            json: true
            callbackUrl: "http://127.0.0.1:3001/"
            redirect: false